AirysDark/NV3047-Core/boards.txt
# Arduino menu labels
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# NV3047-specific menu labels
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

# =========================================================================
# NV3047 High-Priority HMI Board
# Arduino-ESP32 2.0.17 / ESP32-S3
# =========================================================================
nv3047.name=NV3047 High-Priority HMI Board
nv3047.vid.0=0x303a
nv3047.pid.0=0x1001

nv3047.bootloader.tool=esptool_py
nv3047.bootloader.tool.default=esptool_py
nv3047.upload.tool=esptool_py
nv3047.upload.tool.default=esptool_py
nv3047.upload.tool.network=esp_ota
nv3047.upload.speed=921600
nv3047.upload.maximum_size=3145728
nv3047.upload.maximum_data_size=327680
nv3047.upload.flags=
nv3047.upload.extra_flags=
nv3047.upload.erase_cmd=
nv3047.upload.use_1200bps_touch=false
nv3047.upload.wait_for_upload_port=false

nv3047.serial.disableDTR=false
nv3047.serial.disableRTS=false

# Silicon target stays ESP32-S3. NV3047 is the Arduino board/variant identity.
nv3047.build.tarch=xtensa
nv3047.build.bootloader_addr=0x0
nv3047.build.target=esp32s3
nv3047.build.mcu=esp32s3
nv3047.build.core=esp32
nv3047.build.variant=NV3047
nv3047.build.board=NV3047

# Stable baseline defaults.
nv3047.build.usb_mode=1
nv3047.build.cdc_on_boot=0
nv3047.build.msc_on_boot=0
nv3047.build.dfu_on_boot=0
nv3047.build.f_cpu=240000000L
nv3047.build.flash_size=4MB
nv3047.build.flash_freq=80m
nv3047.build.flash_mode=dio
nv3047.build.boot=qio
nv3047.build.boot_freq=80m
nv3047.build.partitions=huge_app
nv3047.build.loop_core=-DARDUINO_RUNNING_CORE=1
nv3047.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nv3047.build.defines=-DBOARD_HAS_PSRAM
nv3047.build.psram_type=qspi
nv3047.build.memory_type={build.boot}_{build.psram_type}

# IMPORTANT:
# Do not add CONFIG_* IDF options here as sketch/compiler defines and claim
# that precompiled ESP-IDF components were rebuilt with them. The recovery
# baseline intentionally uses the stock 2.0.17 esp32s3 SDK until a real
# reproducible SDK rebuild is introduced.

# -------------------------------------------------------------------------
# Upload speed
# -------------------------------------------------------------------------
nv3047.menu.UploadSpeed.921600=921600
nv3047.menu.UploadSpeed.921600.upload.speed=921600
nv3047.menu.UploadSpeed.460800=460800
nv3047.menu.UploadSpeed.460800.upload.speed=460800
nv3047.menu.UploadSpeed.115200=115200
nv3047.menu.UploadSpeed.115200.upload.speed=115200

# -------------------------------------------------------------------------
# JTAG
# -------------------------------------------------------------------------
nv3047.menu.JTAGAdapter.default=Disabled
nv3047.menu.JTAGAdapter.default.build.copy_jtag_files=0
nv3047.menu.JTAGAdapter.builtin=Integrated USB JTAG
nv3047.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
nv3047.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

# -------------------------------------------------------------------------
# PSRAM
# QSPI is first so it is also the non-interactive/CLI default.
# -------------------------------------------------------------------------
nv3047.menu.PSRAM.enabled=QSPI PSRAM
nv3047.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
nv3047.menu.PSRAM.enabled.build.psram_type=qspi
nv3047.menu.PSRAM.disabled=Disabled
nv3047.menu.PSRAM.disabled.build.defines=
nv3047.menu.PSRAM.disabled.build.psram_type=qspi
nv3047.menu.PSRAM.opi=OPI PSRAM (Experimental Hardware Option)
nv3047.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
nv3047.menu.PSRAM.opi.build.psram_type=opi

# -------------------------------------------------------------------------
# Flash mode / speed
# The historical QIO profile is preserved for recovery testing. The image
# write mode remains DIO exactly as in the recovered configuration; change
# only after hardware validation.
# -------------------------------------------------------------------------
nv3047.menu.FlashMode.qio=QIO Boot / 80MHz (Recovered Baseline)
nv3047.menu.FlashMode.qio.build.flash_mode=dio
nv3047.menu.FlashMode.qio.build.boot=qio
nv3047.menu.FlashMode.qio.build.boot_freq=80m
nv3047.menu.FlashMode.qio.build.flash_freq=80m
nv3047.menu.FlashMode.dio=DIO Boot / 80MHz
nv3047.menu.FlashMode.dio.build.flash_mode=dio
nv3047.menu.FlashMode.dio.build.boot=dio
nv3047.menu.FlashMode.dio.build.boot_freq=80m
nv3047.menu.FlashMode.dio.build.flash_freq=80m

# -------------------------------------------------------------------------
# Flash size
# -------------------------------------------------------------------------
nv3047.menu.FlashSize.4M=4MB (32Mb)
nv3047.menu.FlashSize.4M.build.flash_size=4MB
nv3047.menu.FlashSize.8M=8MB (64Mb)
nv3047.menu.FlashSize.8M.build.flash_size=8MB
nv3047.menu.FlashSize.16M=16MB (128Mb)
nv3047.menu.FlashSize.16M.build.flash_size=16MB

# -------------------------------------------------------------------------
# Partition scheme
# -------------------------------------------------------------------------
nv3047.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA / 896KB SPIFFS)
nv3047.menu.PartitionScheme.huge_app.build.partitions=huge_app
nv3047.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nv3047.menu.PartitionScheme.default=Default (1.25MB APP x2 OTA)
nv3047.menu.PartitionScheme.default.build.partitions=default
nv3047.menu.PartitionScheme.default.upload.maximum_size=1310720
nv3047.menu.PartitionScheme.default_8MB=Default 8MB (3.1875MB APP x2 OTA)
nv3047.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nv3047.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

# -------------------------------------------------------------------------
# Arduino task core placement
# -------------------------------------------------------------------------
nv3047.menu.LoopCore.1=Core 1 (Default)
nv3047.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
nv3047.menu.LoopCore.0=Core 0 (Experimental)
nv3047.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

nv3047.menu.EventsCore.1=Core 1 (Default)
nv3047.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nv3047.menu.EventsCore.0=Core 0
nv3047.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

# -------------------------------------------------------------------------
# USB
# -------------------------------------------------------------------------
nv3047.menu.USBMode.hwcdc=Hardware CDC and JTAG
nv3047.menu.USBMode.hwcdc.build.usb_mode=1
nv3047.menu.USBMode.default=USB-OTG (TinyUSB)
nv3047.menu.USBMode.default.build.usb_mode=0

nv3047.menu.CDCOnBoot.default=Disabled
nv3047.menu.CDCOnBoot.default.build.cdc_on_boot=0
nv3047.menu.CDCOnBoot.cdc=Enabled On Boot
nv3047.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

nv3047.menu.MSCOnBoot.default=Disabled
nv3047.menu.MSCOnBoot.default.build.msc_on_boot=0
nv3047.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
nv3047.menu.MSCOnBoot.msc.build.msc_on_boot=1

nv3047.menu.DFUOnBoot.default=Disabled
nv3047.menu.DFUOnBoot.default.build.dfu_on_boot=0
nv3047.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
nv3047.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# -------------------------------------------------------------------------
# Erase flash
# -------------------------------------------------------------------------
nv3047.menu.EraseFlash.none=Disabled
nv3047.menu.EraseFlash.none.upload.erase_cmd=
nv3047.menu.EraseFlash.all=Enabled
nv3047.menu.EraseFlash.all.upload.erase_cmd=erase_flash

# -------------------------------------------------------------------------
# Board revision
# -------------------------------------------------------------------------
nv3047.menu.Revision.v21=V2.1
nv3047.menu.Revision.v21.build.board_rev=21
nv3047.menu.Revision.v10=V1.0 (Legacy)
nv3047.menu.Revision.v10.build.board_rev=10

# -------------------------------------------------------------------------
# Legacy LoRaWAN menu metadata retained from the recovered project.
# These settings are not used by the NV3047 display core itself.
# -------------------------------------------------------------------------
nv3047.menu.LORAWAN_REGION.AU915=AU915 (Australia)
nv3047.menu.LORAWAN_REGION.AU915.build.lorawan_region=2
nv3047.menu.LORAWAN_REGION.US915=US915 (North America)
nv3047.menu.LORAWAN_REGION.US915.build.lorawan_region=1
nv3047.menu.LORAWAN_REGION.EU868=EU868 (Europe)
nv3047.menu.LORAWAN_REGION.EU868.build.lorawan_region=0

nv3047.menu.LoRaWanDebugLevel.none=Disabled
nv3047.menu.LoRaWanDebugLevel.none.build.lorawan_debug=0
nv3047.menu.LoRaWanDebugLevel.basic=Basic Stack Statistics
nv3047.menu.LoRaWanDebugLevel.basic.build.lorawan_debug=1
nv3047.menu.LoRaWanDebugLevel.verbose=Deep Hardware Traffic Logging
nv3047.menu.LoRaWanDebugLevel.verbose.build.lorawan_debug=2

nv3047.menu.LORAWAN_DEVEUI.custom=Sourced from Board Chip ID
nv3047.menu.LORAWAN_DEVEUI.custom.build.lorawan_deveui=1
nv3047.menu.LORAWAN_DEVEUI.factory=Factory Fixed Matrix Layout
nv3047.menu.LORAWAN_DEVEUI.factory.build.lorawan_deveui=0

nv3047.menu.LORAWAN_PREAMBLE_LENGTH.8=8 Symbols
nv3047.menu.LORAWAN_PREAMBLE_LENGTH.8.build.lorawan_preamble=8
nv3047.menu.LORAWAN_PREAMBLE_LENGTH.16=16 Symbols
nv3047.menu.LORAWAN_PREAMBLE_LENGTH.16.build.lorawan_preamble=16
